src/cf/InformationRegisters/НастройкиДополнительныхРеквизитовЭПД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>НастройкиДополнительныхРеквизитовЭПД</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ТипДанных</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Квалификаторы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Перечисления</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Обязательный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Заголовок</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИдентификаторНастройки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ТипДокумента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыДокументовЭДО</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ГруппаДанных</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>180</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторИнформации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КонтрагентБЭД</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/НастройкиДополнительныхРеквизитовЭПД/Forms/ФормаЗаписи/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьЗначенияСвойств(Запись, Параметры);
	
	ТипыДокументовЭПД = Новый Структура;
	ОбменСГИСЭПД.ПриОпределенииСтандартныхТиповДокументов(ТипыДокументовЭПД);
	
	Для Каждого КиЗ Из ТипыДокументовЭПД Цикл
		Элементы.ТипДокумента.СписокВыбора.Добавить(КиЗ.Значение);	
	КонецЦикла;	
	
	Элементы.ТипДанных.СписокВыбора.Добавить("Строка", "Строка");
	Элементы.ТипДанных.СписокВыбора.Добавить("Число", "Число");
	Элементы.ТипДанных.СписокВыбора.Добавить("ДатаВремя", "Дата и время");
	Элементы.ТипДанных.СписокВыбора.Добавить("Дата", "Дата");
	Элементы.ТипДанных.СписокВыбора.Добавить("Время", "Время");
	Элементы.ТипДанных.СписокВыбора.Добавить("Булево", "Булево");
	Элементы.ТипДанных.СписокВыбора.Добавить("Перечисление", "Перечисление (строки)");
	
	Если ЗначениеЗаполнено(Запись.ТипДокумента)
		И ЗначениеЗаполнено(Запись.ГруппаДанных) Тогда
		ГруппыПоДокументу = ОбменСГИСЭПД.ГруппыДанныхДополнительныхПолей(Запись.ТипДокумента);
		СтруктураГруппы = Неопределено;
		Если ГруппыПоДокументу.Свойство(Запись.ГруппаДанных, СтруктураГруппы) Тогда
			Узел = СтруктураГруппы.Узел;
		Иначе
			Узел = "//Card/Description/AdditionalData/AdditionalParameter[@Name=" + Запись.ГруппаДанных + "*]/@Value";
		КонецЕсли;
	КонецЕсли;
	
	Элементы.ГруппаДанных.Доступность = ЗначениеЗаполнено(Запись.ТипДокумента);
	
	ВидимостьЭлементов(Элементы, Запись.ТипДанных);
	
	Если Запись.ТипДанных = "Перечисление" Тогда
		ОтображениеПеречислений();
	Иначе
		Если ЗначениеЗаполнено(Запись.Перечисления) Тогда
			Запись.Перечисления = Неопределено;
		КонецЕсли;
		
		Если Запись.ТипДанных = "Число" Тогда
			Квалификаторы = СтрРазделить(Запись.Квалификаторы, ",", Ложь);
			Если Квалификаторы.Количество() > 0 И ЗначениеЗаполнено(Квалификаторы[0]) Тогда
				Квалификатор1 = Число(Квалификаторы[0]);
			КонецЕсли;
			Если Квалификаторы.Количество() > 1 И ЗначениеЗаполнено(Квалификаторы[1]) Тогда
				Квалификатор2 = Число(Квалификаторы[1]);
			КонецЕсли;
			// По умолчанию
			Если Квалификатор1 = 0 Тогда
				Квалификатор1 = 15;	
			КонецЕсли;
		ИначеЕсли Запись.ТипДанных = "Строка" Тогда
			Если ЗначениеЗаполнено(Запись.Квалификаторы) Тогда
				Квалификатор1 = Число(Запись.Квалификаторы);
			КонецЕсли;
			// По умолчанию
			Если Квалификатор1 = 0 Тогда
				Квалификатор1 = 2000;	
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	ПоказатьПредупреждениеОРеквизите(Элементы.НадписьПредупреждение, Узел);

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ПоказатьПредупреждениеОРеквизите(Элемент, Узел)
	
	Если ОбменСГИСЭПДКлиентСервер.ИспользуютсяДополнительныеРеквизитыЭПД() = 0 Тогда
		Элемент.Заголовок = НСтр("ru='Функционал дополнительных реквизитов не используется и будет задействован в следующих релизах'");	
		Элемент.Видимость = Истина;
	ИначеЕсли ОбменСГИСЭПДКлиентСервер.ИспользуютсяДополнительныеРеквизитыЭПД() = 1
	И СтрНачинаетсяС(Узел, "//Card") Тогда
		Элемент.Заголовок = НСтр("ru='Добавление реквизита на этом уровне не предусмотрено форматом, передаваться по ЭДО он не будет.
			|Передача таких реквизитов будет поддержана в следующих релизах'");
		Элемент.Видимость = Истина;
	Иначе
		Элемент.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ВидимостьЭлементов(Элементы, ТипДанных)
	
	Элементы.Квалификатор1.Видимость = ТипДанных = "Строка" Или ТипДанных = "Число";
	Элементы.Квалификатор2.Видимость = ТипДанных = "Число";
	Элементы.ГруппаПеречисления.Видимость = ТипДанных = "Перечисление";
	
	Если ТипДанных = "Строка" Тогда
		Элементы.Квалификатор1.Заголовок = НСтр("ru='Длина строки'");
	ИначеЕсли ТипДанных = "Число" Тогда
		Элементы.Квалификатор1.Заголовок = НСтр("ru='Длина'");
		Элементы.Квалификатор2.Заголовок = НСтр("ru='Точность'");	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВводПеречислений(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Перечисления", Запись.Перечисления);
	
	ОписаниеОповещенияОЗакрытии = Новый ОписаниеОповещения("ВводПеречислений_Завершение", ЭтотОбъект);
	
	ОткрытьФорму("РегистрСведений.НастройкиДополнительныхРеквизитовЭПД.Форма.ФормаВводаЗначенийПеречисления", 
		ПараметрыФормы,
		ЭтотОбъект, 
		УникальныйИдентификатор,,,
		ОписаниеОповещенияОЗакрытии,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

&НаКлиенте
Процедура ВводПеречислений_Завершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Запись.Перечисления = Результат;
	
	ОтображениеПеречислений();	
			
КонецПроцедуры

&НаСервере
Процедура ОтображениеПеречислений()
	
	Элементы.ВводПеречислений.Заголовок = СтрСоединить(СтрРазделить(Запись.Перечисления, "|", Ложь), ", ");
	Если ЗначениеЗаполнено(Элементы.ВводПеречислений.Заголовок) = Ложь Тогда
		Элементы.ВводПеречислений.Заголовок = НСтр("ru='Заполните'");
		Элементы.ВводПеречислений.ЦветТекста = WebЦвета.Красный;
	Иначе
		Элементы.ВводПеречислений.ЦветТекста = ЦветаСтиля.ГиперссылкаЦвет;	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТипДокументаПриИзменении(Элемент)
	
	Запись.ГруппаДанных = Неопределено;
	Узел = Неопределено;
	Элементы.ГруппаДанных.Доступность = ЗначениеЗаполнено(Запись.ТипДокумента);

КонецПроцедуры

&НаКлиенте
Процедура ТипДанныхПриИзменении(Элемент)
	
	ВидимостьЭлементов(Элементы, Запись.ТипДанных);
	СохранитьКвалификаторы();
	ОтображениеПеречислений();

КонецПроцедуры

&НаКлиенте
Процедура СохранитьКвалификаторы()
	
	Если Запись.ТипДанных = "Число" Тогда
		Запись.Квалификаторы = Строка(Квалификатор1) + "," + Строка(Квалификатор2);
	ИначеЕсли Запись.ТипДанных = "Строка" Тогда
		Запись.Квалификаторы = Строка(Квалификатор1);
	Иначе
		Запись.Квалификаторы = Неопределено;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Квалификатор1ПриИзменении(Элемент)
	
	СохранитьКвалификаторы();
	
КонецПроцедуры

&НаКлиенте
Процедура Квалификатор2ПриИзменении(Элемент)
	
	СохранитьКвалификаторы();

КонецПроцедуры

&НаКлиенте
Процедура ГруппаДанныхНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ТипДокумента", Запись.ТипДокумента);
	Если ЗначениеЗаполнено(Запись.ГруппаДанных) Тогда
		ПараметрыФормы.Вставить("ГруппаДанных", Запись.ГруппаДанных);
	КонецЕсли;
	
	ОписаниеОповещенияОЗакрытии = Новый ОписаниеОповещения("ГруппаДанныхНачалоВыбора_Завершение", ЭтотОбъект);
	
	ОткрытьФорму("РегистрСведений.НастройкиДополнительныхРеквизитовЭПД.Форма.ФормаВыбораГруппыДанных", 
		ПараметрыФормы, 
		ЭтотОбъект, 
		УникальныйИдентификатор,,,
		ОписаниеОповещенияОЗакрытии,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

&НаКлиенте
Процедура ГруппаДанныхНачалоВыбора_Завершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> Неопределено Тогда
		Запись.ГруппаДанных = Результат.ГруппаДанных;
		Если ЗначениеЗаполнено(Результат.Узел) Тогда
			Узел = Результат.Узел;
		Иначе
			Узел = "//Card/Description/AdditionalData/AdditionalParameter[@Name=" + Запись.ГруппаДанных + "*]/@Value";
		КонецЕсли;
		ПоказатьПредупреждениеОРеквизите(Элементы.НадписьПредупреждение, Узел);
	КонецЕсли;
	
КонецПроцедуры
